app/controllers/api/v1/omniauth_callbacks_controller.rb

  def omniauth_success
    auth_info = request.env['omniauth.auth']
    user = User.find_by(uid: auth_info.uid, provider: 'github')
    unless user
      user = User.new
      user.provider = 'github'
      user.uid = auth_info.uid
      user.email = auth_info.info.email
      user.name = auth_info.info.name
    end
    token = DeviseTokenAuth::TokenFactory.create
    user.tokens[token.client] = {
      token:  token.token_hash,
      expiry: token.expiry
    }
    user.save
---
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 AND "users"."provider" = $2 LIMIT $3  [["uid", "78046418"], ["provider", "github"], ["LIMIT", 1]]
INSERT INTO "users" ("provider", "uid", "name", "email", "tokens", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3