app/controllers/api/v1/todo_items_controller.rb

  def index
    @todo_items = Todolist.where(user_id: current_user[:id]).order(:id).reverse
---
SELECT "todolists".* FROM "todolists" WHERE "todolists"."user_id" = $1 ORDER BY "todolists"."id" ASC  [["user_id", 1]]

  def create
    new_todo_item = Todolist.new(user_id: current_user[:id],
                                 title: params[:title],
                                 complete: params[:complete])
    new_todo_item.save
---
INSERT INTO "todolists" ("title", "complete", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["complete", false], ["user_id", 1], ["created_at", "2021-08-05 12:15:04.341937"], ["updated_at", "2021-08-05 12:15:04.341937"]]

  def update
    updated_todo_item = Todolist.find_by(id: params[:id])
    updated_todo_item.update(title: params[:edit_title], complete: params[:edit_complete])
    updated_todo_item.save
---
SELECT "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
UPDATE "todolists" SET "title" = $1, "complete" = $2, "updated_at" = $3 WHERE "todolists"."id" = $4  [["title", nil], ["complete", nil], ["updated_at", "2021-08-05 13:28:16.324946"], ["id", 56]]

  def destroy
    if Todolist.find_by(id: params[:id]).destroy
---
DELETE FROM "todolists" WHERE "todolists"."id" = $1  [["id", 69]]
SELECT "todolists".* FROM "todolists" WHERE "todolists"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]